app/Http/Controllers/Auth/RegisterController.php

    protected function create(array $data): User
    {
        return DB::transaction(function () use ($data) {
            $user = User::create([
                'name' => $data['name'],
                'email' => $data['email'],
                'password' => Hash::make($data['password']),
                'user_type' => $data['user_type'],
                'is_active' => true,
            ]);

            // Assign Spatie role based on user_type
            $user->assignRole($data['user_type']);

            UserProfile::create([
                'user_id' => $user->id,
            ]);
---
insert into `users` (`name`, `email`, `password`, `user_type`, `is_active`, `updated_at`, `created_at`) values ('TT', 'TTT@GMAIL.COM', '$2y$12$VZGBWJpyyfhf4.diVxOqD./q3vKFUYV2ELgcgaK7WOR4TuO9dJ9jy', 'job_seeker', 1, '2025-12-06 16:52:01', '2025-12-06 16:52:01')
insert into `user_profiles` (`user_id`, `updated_at`, `created_at`) values (4, '2025-12-06 16:52:01', '2025-12-06 16:52:01')