app/Http/Controllers/JobSeeker/ApplicationController.php

    public function index()
    {
        $applications = JobApplication::with(['job.company'])
            ->where('user_id', Auth::id())
            ->orderBy('created_at', 'desc')
            ->paginate(10);
---
select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `job_applications` where `user_id` = 2 and `job_applications`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `job_applications` where `user_id` = 2 and `job_applications`.`deleted_at` is null

    public function show(JobApplication $application)
    {
        $this->authorizeApplication($application);

        $application->load(['job.company', 'job.questions']);
---
select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null

    public function create(Job $job)
    {
        // Check if already applied
        $existingApplication = JobApplication::where('user_id', Auth::id())
            ->where('job_id', $job->id)
            ->first();
---
select * from `job_applications` where `user_id` = 4 and `job_id` = 1 and `job_applications`.`deleted_at` is null limit 1

    public function store(StoreApplicationRequest $request, Job $job)
    {
        // Check if job is still accepting applications
        if ($job->status !== 'published' || ($job->expires_at && $job->expires_at->isPast())) {
            return back()->with('error', 'This job is no longer accepting applications.');
        }

        $resumePath = null;

        try {
            return DB::transaction(function () use ($request, $job, &$resumePath) {
                // Check for existing application with lock to prevent race condition
                $existingApplication = JobApplication::where('user_id', Auth::id())
                    ->where('job_id', $job->id)
                    ->lockForUpdate()
                    ->first();
---
select * from `job_applications` where `user_id` = 2 and `job_id` = 1 and `job_applications`.`deleted_at` is null limit 1 for update

                $coverLetter = strip_tags($request->cover_letter);

                // Create application
                $application = JobApplication::create([
                    'user_id' => Auth::id(),
                    'job_id' => $job->id,
                    'cover_letter' => $coverLetter,
                    'resume_path' => $resumePath,
                    'answers' => $answers,
                    'status' => ApplicationStatus::PENDING->value,
                    'applied_at' => now(),
                ]);
---
insert into `job_applications` (`user_id`, `job_id`, `cover_letter`, `resume_path`, `answers`, `status`, `applied_at`, `uuid`, `updated_at`, `created_at`) values (2, 1, 'Moonless night.\r\nThe power cut silenced the city, but not his thoughts.\r\nDeadlines, debts, unfinished code repositories marched past.\r\nHe lit a candle, meaning to keep working.\r\nInstead, he shut the laptop, breathed, and simply watched the flame.\r\nFor the first time in years, nothing crashed.', 'resumes/2/69347332816a1/YnV6VOGxz5dw3Kx8h1DKI0apyIX01QSVKUzmGPDF.pdf', null, 'pending', '2025-12-06 18:17:22', '6143500d-9733-4927-812e-8fc6cb4da729', '2025-12-06 18:17:22', '2025-12-06 18:17:22')