app/Http/Controllers/JobSeeker/DashboardController.php

select count(*) as aggregate from `job_applications` where `user_id` = 4 and `job_applications`.`deleted_at` is null
select count(*) as aggregate from `saved_jobs` where `user_id` = 4
select count(*) as aggregate from `job_alerts` where `user_id` = 4
select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `job_applications` where `user_id` = 4 and `job_applications`.`deleted_at` is null order by `created_at` desc limit 5
---
    public function index()
    {
        $user = Auth::user();

        // Get counts
        $applicationCount = JobApplication::where('user_id', $user->id)->count();
        $savedJobsCount = SavedJob::where('user_id', $user->id)->count();
        $alertsCount = JobAlert::where('user_id', $user->id)->count();

        // Calculate profile completion percentage
        $profileCompletion = $this->calculateProfileCompletion($user);

        // Get recent applications
        $recentApplications = JobApplication::with(['job.company'])
            ->where('user_id', $user->id)
            ->latest()
            ->take(5)
            ->get();