app/Http/Controllers/JobSeeker/JobAlertController.php

select * from `job_alerts` where `job_alerts`.`user_id` = 4 and `job_alerts`.`user_id` is not null order by `created_at` desc
---
    public function index()
    {
        $alerts = auth()->user()->jobAlerts()->with(['category', 'jobType', 'employmentType'])->latest()->get();