app/Http/Controllers/JobSeeker/ProfileController.php

select * from `user_profiles` where `user_profiles`.`user_id` in (4) and `user_profiles`.`deleted_at` is null
---
    public function edit()
    {
        $user = auth()->user()->load('profile');

update `users` set `avatar` = 'avatars/9s3MiGSyCndEtJzwAn4lD2Bs85Ido0zRy7Zqo7qr.jpg', `users`.`updated_at` = '2025-12-06 17:44:28' where `id` = 4
---
            $userData['avatar'] = $request->file('avatar')->store('avatars', 'public');
        }

        auth()->user()->update($userData);