app/Http/Controllers/JobSeeker/SavedJobController.php

select exists(select * from `saved_jobs` where `user_id` = 4 and `job_id` = 1) as `exists`
insert into `saved_jobs` (`user_id`, `job_id`, `updated_at`, `created_at`) values (4, 1, '2025-12-06 16:56:40', '2025-12-06 16:56:40')
---
    public function store(Job $job)
    {
        $exists = SavedJob::where('user_id', auth()->id())->where('job_id', $job->id)->exists();

        if (!$exists) {
            SavedJob::create(['user_id' => auth()->id(), 'job_id' => $job->id]);