{
    "Welcome to PlaceMeNet - Find Your Dream Job": "Καλώς ήρθατε στο PlaceMeNet - Βρείτε την ιδανική δουλειά",
    "Find Your": "Βρείτε το",
    "Dream Job": "όνειρο επάγγελμα",
    "Today": "σήμερα",
    "Connect with thousands of top employers and discover": "Συνδεθείτε με χιλιάδες κορυφαίους εργοδότες και ανακαλύψτε",
    "opportunities": "ευκαιρίες",
    "Your next career move starts here": "Το επόμενο βήμα στην καριέρα σας ξεκινά εδώ",
    "Job title, keywords, or company": "Τίτλος θέσης, λέξεις-κλειδιά ή εταιρεία",
    "City, state, or remote": "Πόλη, περιφέρεια ή εξ αποστάσεως",
    "Search Jobs": "Αναζήτηση θέσεων",
    "Popular:": "Δημοφιλή:",
    "Software Engineer": "Μηχανικός λογισμικού",
    "Marketing": "Μάρκετινγκ",
    "Remote Jobs": "Θέσεις εξ αποστάσεως",
    "Data Analyst": "Αναλυτής δεδομένων",
    "Job Seeker Login": "Σύνδεση υποψηφίου",
    "Employer Login": "Σύνδεση εργοδότη",
    "Register Now": "Εγγραφείτε τώρα",
    "Upload Resume": "Ανεβάστε βιογραφικό",
    "Active Jobs": "Ενεργές θέσεις",
    "Companies": "Εταιρείες",
    "Job Seekers": "Υποψήφιοι",
    "Success Rate": "Ποσοστό επιτυχίας",
    "Browse Jobs by Category": "Αναζήτηση θέσεων ανά κατηγορία",
    "Explore opportunities across various industries": "Εξερευνήστε ευκαιρίες σε διάφορους κλάδους",
    "jobs": "θέσεις",
    "No categories available": "Δεν υπάρχουν διαθέσιμες κατηγορίες",
    "View All Categories": "Προβολή όλων των κατηγοριών",
    "Featured Jobs": "Προτεινόμενες θέσεις",
    "Hand-picked opportunities from top companies": "Επιλεγμένες ευκαιρίες από κορυφαίες εταιρείες",
    "Featured": "Προτεινόμενο",
    "Competitive": "Ανταγωνιστικό",
    "Apply Now": "Κάντε αίτηση",
    "No featured jobs available": "Δεν υπάρχουν προτεινόμενες θέσεις",
    "Browse All Jobs": "Προβολή όλων των θέσεων",
    "How It Works": "Πώς λειτουργεί",
    "Your journey to the perfect job in three simple steps": "Το ταξίδι προς τη δουλειά σας σε τρία απλά βήματα",
    "Create Your Profile": "Δημιουργήστε το προφίλ σας",
    "Sign up and build your professional profile with skills and experience": "Εγγραφείτε και δημιουργήστε το επαγγελματικό σας προφίλ με δεξιότητες και εμπειρία",
    "Search & Apply": "Αναζητήστε και κάντε αίτηση",
    "Browse thousands of jobs and apply with one click": "Περιηγηθείτε σε χιλιάδες θέσεις και κάντε αίτηση με ένα κλικ",
    "Get Hired": "Προσληφθείτε",
    "Connect with employers and land your dream job": "Συνδεθείτε με εργοδότες και κερδίστε τη δουλειά των ονείρων σας",
    "Ready to Start Your Career Journey?": "Έτοιμοι να ξεκινήσετε το επαγγελματικό σας ταξίδι;",
    "Join thousands of job seekers who found their dream jobs": "Γίνετε μέλος χιλιάδων υποψηφίων που βρήκαν τη δουλειά των ονείρων τους",
    "Create Free Account": "Δημιουργήστε δωρεάν λογαριασμό",
    "Browse Jobs": "Περιηγηθείτε στις θέσεις",
    "About": "Σχετικά",
    "Contact": "Επικοινωνία",
    "Dashboard": "Πίνακας ελέγχου",
    "My Jobs": "Οι θέσεις μου",
    "My Applications": "Οι αιτήσεις μου",
    "Contact Us": "Επικοινωνήστε μαζί μας",
    "WhatsApp": "WhatsApp",
    "Login": "Σύνδεση",
    "Register": "Εγγραφή",
    "Profile": "Προφίλ",
    "Logout": "Αποσύνδεση",
    "Language": "Γλώσσα"
,
    "About PlaceMeNet": "Σχετικά με το PlaceMeNet",
    "Our Story": "Η ιστορία μας",
    "Connecting brilliant talent with ambitious employers across Europe.": "Συνδέουμε λαμπρά ταλέντα με φιλόδοξους εργοδότες σε όλη την Ευρώπη.",
    "PlaceMeNet was founded with a simple promise: simplify recruitment for fast-growing teams and remove the friction job seekers face when chasing their next career milestone. From curated roles to real-time coaching, we fuse technology with a human touch to build careers that matter.": "Το PlaceMeNet ιδρύθηκε με μια απλή υπόσχεση: να απλοποιήσει την πρόσληψη για ταχέως αναπτυσσόμενες ομάδες και να αφαιρέσει την τριβή που αντιμετωπίζουν οι υποψήφιοι όταν επιδιώκουν το επόμενο βήμα τους. Από επιλεγμένους ρόλους μέχρι καθοδήγηση σε πραγματικό χρόνο, συνδυάζουμε τεχνολογία και ανθρώπινη προσέγγιση για να χτίζουμε καριέρες που μετράνε.",
    "Chat on WhatsApp": "Συνομιλία στο WhatsApp",
    "Working Hours": "Ώρες λειτουργίας",
    "Stay Safe from Job Scams": "Μείνετε ασφαλείς από εργασιακές απάτες",
    "PlacemeNet is committed to worker protection. Follow these rules and share them with your friends and family applying overseas.": "Το PlacemeNet δεσμεύεται για την προστασία των εργαζομένων. Ακολουθήστε αυτούς τους κανόνες και μοιραστείτε τους με φίλους και οικογένεια που κάνουν αιτήσεις στο εξωτερικό.",
    "PlacemeNet is 100% free": "Το PlacemeNet είναι 100% δωρεάν",
    "We never charge registration fees, sell visas, or take worker commission. Anyone asking for money in our name is a scam.": "Δεν χρεώνουμε ποτέ εγγραφή, δεν πουλάμε βίζες και δεν λαμβάνουμε προμήθεια από εργαζόμενους. Όποιος ζητά χρήματα στο όνομά μας είναι απάτη.",
    "Never pay for a job": "Μην πληρώνετε ποτέ για δουλειά",
    "Do not send money via cash, bank, Easypaisa, JazzCash, WhatsApp, or crypto. Genuine employers handle costs legally.": "Μην στέλνετε χρήματα με μετρητά, τράπεζα, Easypaisa, JazzCash, WhatsApp ή crypto. Οι νόμιμοι εργοδότες καλύπτουν τα έξοδα νόμιμα.",
    "Verify the employer": "Επαληθεύστε τον εργοδότη",
    "Collect a written offer, company license, visa document, and detailed contract before you travel. Contact us if anything looks suspicious.": "Λάβετε γραπτή προσφορά, άδεια εταιρείας, έγγραφο βίζας και αναλυτικό συμβόλαιο πριν ταξιδέψετε. Επικοινωνήστε μαζί μας αν κάτι φαίνεται ύποπτο.",
    "Official communication only": "Μόνο επίσημη επικοινωνία",
    "PlacemeNet does not operate via TikTok, Telegram, or random WhatsApp agents. Trust only @placemenet.net emails or the website chat.": "Το PlacemeNet δεν λειτουργεί μέσω TikTok, Telegram ή τυχαίων πρακτόρων WhatsApp. Εμπιστευθείτε μόνο email @placemenet.net ή το chat της ιστοσελίδας.",
    "Feel unsafe? Email :support or :legal. We block offenders and report them to authorities.": "Νιώθετε ανασφαλείς; Στείλτε email στο :support ή στο :legal. Αποκλείουμε παραβάτες και τους αναφέρουμε στις αρχές.",
    "Worker Dashboard Highlights": "Κύρια σημεία πίνακα υποψηφίου",
    "Apply for overseas jobs and track every application.": "Κάντε αίτηση για θέσεις στο εξωτερικό και παρακολουθήστε κάθε αίτηση.",
    "Complete your profile with experience, skills, passport, and preferred countries.": "Συμπληρώστε το προφίλ σας με εμπειρία, δεξιότητες, διαβατήριο και προτιμώμενες χώρες.",
    "Receive interview calls, employer messages, and safety alerts reminding you PlacemeNet is always free.": "Λάβετε κλήσεις συνεντεύξεων, μηνύματα εργοδοτών και ειδοποιήσεις ασφάλειας που θυμίζουν ότι το PlacemeNet είναι πάντα δωρεάν.",
    "Manage account settings—update phone/email or delete your account anytime.": "Διαχειριστείτε τις ρυθμίσεις λογαριασμού—ενημερώστε τηλέφωνο/email ή διαγράψτε τον λογαριασμό σας οποιαδήποτε στιγμή.",
    "Employer Dashboard Promise": "Υπόσχεση πίνακα εργοδότη",
    "Post jobs for free in Greece or Albania and get unlimited applications.": "Δημοσιεύστε δωρεάν θέσεις σε Ελλάδα ή Αλβανία και λάβετε απεριόριστες αιτήσεις.",
    "Review skills, shortlist candidates, and message workers directly.": "Εξετάστε δεξιότητες, δημιουργήστε shortlists και στείλτε μηνύματα απευθείας.",
    "Keep hiring transparent—no fake jobs, no illegal recruitment fees, and full compliance with labor laws.": "Κρατήστε τις προσλήψεις διαφανείς—χωρίς ψεύτικες θέσεις, χωρίς παράνομες χρεώσεις και πλήρη συμμόρφωση με την εργατική νομοθεσία.",
    "Violations lead to permanent bans because we protect both workers and reputable employers.": "Παραβάσεις οδηγούν σε μόνιμες απαγορεύσεις γιατί προστατεύουμε εργαζόμενους και σοβαρούς εργοδότες.",
    "Contact PlaceMeNet": "Επικοινωνήστε με το PlaceMeNet",
    "Get in touch": "Επικοινωνήστε μαζί μας",
    "We are here to support your next hire or career move.": "Είμαστε εδώ για να υποστηρίξουμε την επόμενη πρόσληψη ή κίνηση καριέρας σας.",
    "Reach our talent success team by phone, WhatsApp, or visit one of our offices during opening hours. We’ll route your message to the right specialist right away.": "Επικοινωνήστε με την ομάδα επιτυχίας ταλέντου μέσω τηλεφώνου, WhatsApp ή επισκεφθείτε ένα από τα γραφεία μας στις ώρες λειτουργίας. Θα προωθήσουμε άμεσα το μήνυμά σας στον σωστό ειδικό.",
    "Email Us": "Στείλτε μας email",
    "WhatsApp: :number": "WhatsApp: :number",
    "Head Office": "Κεντρικό γραφείο",
    "Open in Google Maps": "Άνοιγμα στο Google Maps"
}
