{
    "Welcome to PlaceMeNet - Find Your Dream Job": "Bienvenido a PlaceMeNet - Encuentra tu trabajo ideal",
    "Find Your": "Encuentra tu",
    "Dream Job": "trabajo soñado",
    "Today": "hoy",
    "Connect with thousands of top employers and discover": "Conéctate con miles de empleadores líderes y descubre",
    "opportunities": "oportunidades",
    "Your next career move starts here": "Tu próximo paso profesional comienza aquí",
    "Job title, keywords, or company": "Título del puesto, palabras clave o empresa",
    "City, state, or remote": "Ciudad, estado o remoto",
    "Search Jobs": "Buscar empleos",
    "Popular:": "Popular:",
    "Software Engineer": "Ingeniero de software",
    "Marketing": "Marketing",
    "Remote Jobs": "Empleos remotos",
    "Data Analyst": "Analista de datos",
    "Job Seeker Login": "Ingreso para candidatos",
    "Employer Login": "Ingreso para empleadores",
    "Register Now": "Regístrate ahora",
    "Upload Resume": "Sube tu currículum",
    "Active Jobs": "Empleos activos",
    "Companies": "Empresas",
    "Job Seekers": "Candidatos",
    "Success Rate": "Tasa de éxito",
    "Browse Jobs by Category": "Explora empleos por categoría",
    "Explore opportunities across various industries": "Explora oportunidades en múltiples industrias",
    "jobs": "empleos",
    "No categories available": "No hay categorías disponibles",
    "View All Categories": "Ver todas las categorías",
    "Featured Jobs": "Empleos destacados",
    "Hand-picked opportunities from top companies": "Oportunidades seleccionadas de las mejores empresas",
    "Featured": "Destacado",
    "Competitive": "Competitivo",
    "Apply Now": "Postular ahora",
    "No featured jobs available": "No hay empleos destacados disponibles",
    "Browse All Jobs": "Ver todos los empleos",
    "How It Works": "Cómo funciona",
    "Your journey to the perfect job in three simple steps": "Tu camino al empleo ideal en tres pasos sencillos",
    "Create Your Profile": "Crea tu perfil",
    "Sign up and build your professional profile with skills and experience": "Regístrate y crea tu perfil profesional con habilidades y experiencia",
    "Search & Apply": "Busca y postula",
    "Browse thousands of jobs and apply with one click": "Explora miles de empleos y postula con un clic",
    "Get Hired": "Consigue el empleo",
    "Connect with employers and land your dream job": "Conéctate con empleadores y logra tu trabajo soñado",
    "Ready to Start Your Career Journey?": "¿Listo para iniciar tu camino profesional?",
    "Join thousands of job seekers who found their dream jobs": "Únete a miles de candidatos que encontraron su trabajo ideal",
    "Create Free Account": "Crear cuenta gratis",
    "Browse Jobs": "Explorar empleos",
    "About": "Acerca de",
    "Contact": "Contacto",
    "Dashboard": "Panel",
    "My Jobs": "Mis empleos",
    "My Applications": "Mis postulaciones",
    "Contact Us": "Contáctanos",
    "WhatsApp": "WhatsApp",
    "Login": "Ingresar",
    "Register": "Registrarse",
    "Profile": "Perfil",
    "Logout": "Cerrar sesión",
    "Language": "Idioma"
,
    "About PlaceMeNet": "Acerca de PlaceMeNet",
    "Our Story": "Nuestra historia",
    "Connecting brilliant talent with ambitious employers across Europe.": "Conectamos talento brillante con empleadores ambiciosos en Europa.",
    "PlaceMeNet was founded with a simple promise: simplify recruitment for fast-growing teams and remove the friction job seekers face when chasing their next career milestone. From curated roles to real-time coaching, we fuse technology with a human touch to build careers that matter.": "PlaceMeNet nació con una promesa simple: simplificar la contratación para equipos en crecimiento y eliminar la fricción que enfrentan los candidatos al buscar su siguiente paso. Combinamos roles seleccionados y asesoría en tiempo real para construir carreras que importan.",
    "Chat on WhatsApp": "Chatea por WhatsApp",
    "Working Hours": "Horario",
    "Stay Safe from Job Scams": "Mantente seguro frente a estafas laborales",
    "PlacemeNet is committed to worker protection. Follow these rules and share them with your friends and family applying overseas.": "PlacemeNet está comprometido con la protección de los trabajadores. Sigue estas reglas y compártelas con tus amigos y familia que aplican al extranjero.",
    "PlacemeNet is 100% free": "PlacemeNet es 100% gratis",
    "We never charge registration fees, sell visas, or take worker commission. Anyone asking for money in our name is a scam.": "Nunca cobramos inscripción, vendemos visados ni cobramos comisión al trabajador. Quien pida dinero en nuestro nombre es una estafa.",
    "Never pay for a job": "Nunca pagues por un trabajo",
    "Do not send money via cash, bank, Easypaisa, JazzCash, WhatsApp, or crypto. Genuine employers handle costs legally.": "No envíes dinero en efectivo, banco, Easypaisa, JazzCash, WhatsApp o cripto. Los empleadores legítimos cubren costos de forma legal.",
    "Verify the employer": "Verifica al empleador",
    "Collect a written offer, company license, visa document, and detailed contract before you travel. Contact us if anything looks suspicious.": "Obtén una oferta escrita, licencia de la empresa, documento de visa y contrato detallado antes de viajar. Contáctanos si algo parece sospechoso.",
    "Official communication only": "Solo comunicación oficial",
    "PlacemeNet does not operate via TikTok, Telegram, or random WhatsApp agents. Trust only @placemenet.net emails or the website chat.": "PlacemeNet no opera por TikTok, Telegram ni agentes aleatorios de WhatsApp. Confía solo en correos @placemenet.net o el chat del sitio.",
    "Feel unsafe? Email :support or :legal. We block offenders and report them to authorities.": "¿Te sientes inseguro? Escribe a :support o :legal. Bloqueamos infractores y los reportamos a las autoridades.",
    "Worker Dashboard Highlights": "Lo mejor del panel del candidato",
    "Apply for overseas jobs and track every application.": "Postula a empleos en el extranjero y sigue cada aplicación.",
    "Complete your profile with experience, skills, passport, and preferred countries.": "Completa tu perfil con experiencia, habilidades, pasaporte y países preferidos.",
    "Receive interview calls, employer messages, and safety alerts reminding you PlacemeNet is always free.": "Recibe llamadas de entrevista, mensajes de empleadores y alertas de seguridad que recuerdan que PlacemeNet siempre es gratis.",
    "Manage account settings—update phone/email or delete your account anytime.": "Administra tu cuenta: actualiza teléfono/correo o elimina tu cuenta cuando quieras.",
    "Employer Dashboard Promise": "Promesa del panel del empleador",
    "Post jobs for free in Greece or Albania and get unlimited applications.": "Publica vacantes gratis en Grecia o Albania y recibe postulaciones ilimitadas.",
    "Review skills, shortlist candidates, and message workers directly.": "Revisa habilidades, preselecciona candidatos y envía mensajes directos.",
    "Keep hiring transparent—no fake jobs, no illegal recruitment fees, and full compliance with labor laws.": "Mantén la contratación transparente: nada de empleos falsos, ni comisiones ilegales, con total cumplimiento laboral.",
    "Violations lead to permanent bans because we protect both workers and reputable employers.": "Las infracciones implican vetos permanentes porque protegemos a trabajadores y empleadores serios.",
    "Contact PlaceMeNet": "Contactar a PlaceMeNet",
    "Get in touch": "Ponte en contacto",
    "We are here to support your next hire or career move.": "Estamos aquí para apoyar tu próxima contratación o movimiento profesional.",
    "Reach our talent success team by phone, WhatsApp, or visit one of our offices during opening hours. We’ll route your message to the right specialist right away.": "Contacta a nuestro equipo de éxito de talento por teléfono, WhatsApp o visita una de nuestras oficinas en horario de atención. Derivaremos tu mensaje al especialista adecuado de inmediato.",
    "Email Us": "Escríbenos",
    "WhatsApp: :number": "WhatsApp: :number",
    "Head Office": "Oficina central",
    "Open in Google Maps": "Abrir en Google Maps"
}
