{
    "Welcome to PlaceMeNet - Find Your Dream Job": "Bem-vindo ao PlaceMeNet - Encontre o seu emprego dos sonhos",
    "Find Your": "Encontre o seu",
    "Dream Job": "emprego dos sonhos",
    "Today": "hoje",
    "Connect with thousands of top employers and discover": "Conecte-se com milhares de grandes empresas e descubra",
    "opportunities": "oportunidades",
    "Your next career move starts here": "Seu próximo passo de carreira começa aqui",
    "Job title, keywords, or company": "Cargo, palavras-chave ou empresa",
    "City, state, or remote": "Cidade, estado ou remoto",
    "Search Jobs": "Buscar vagas",
    "Popular:": "Popular:",
    "Software Engineer": "Engenheiro de software",
    "Marketing": "Marketing",
    "Remote Jobs": "Vagas remotas",
    "Data Analyst": "Analista de dados",
    "Job Seeker Login": "Login do candidato",
    "Employer Login": "Login do empregador",
    "Register Now": "Cadastre-se agora",
    "Upload Resume": "Envie seu currículo",
    "Active Jobs": "Vagas ativas",
    "Companies": "Empresas",
    "Job Seekers": "Candidatos",
    "Success Rate": "Taxa de sucesso",
    "Browse Jobs by Category": "Procure vagas por categoria",
    "Explore opportunities across various industries": "Explore oportunidades em diversos setores",
    "jobs": "vagas",
    "No categories available": "Nenhuma categoria disponível",
    "View All Categories": "Ver todas as categorias",
    "Featured Jobs": "Vagas em destaque",
    "Hand-picked opportunities from top companies": "Oportunidades selecionadas de grandes empresas",
    "Featured": "Destaque",
    "Competitive": "Competitivo",
    "Apply Now": "Candidatar-se",
    "No featured jobs available": "Não há vagas em destaque",
    "Browse All Jobs": "Ver todas as vagas",
    "How It Works": "Como funciona",
    "Your journey to the perfect job in three simple steps": "Sua jornada para o emprego ideal em três passos simples",
    "Create Your Profile": "Crie seu perfil",
    "Sign up and build your professional profile with skills and experience": "Cadastre-se e monte seu perfil profissional com habilidades e experiência",
    "Search & Apply": "Busque e candidate-se",
    "Browse thousands of jobs and apply with one click": "Veja milhares de vagas e candidate-se com um clique",
    "Get Hired": "Seja contratado",
    "Connect with employers and land your dream job": "Conecte-se com empregadores e conquiste o emprego dos sonhos",
    "Ready to Start Your Career Journey?": "Pronto para começar sua jornada profissional?",
    "Join thousands of job seekers who found their dream jobs": "Junte-se a milhares de candidatos que encontraram o emprego ideal",
    "Create Free Account": "Criar conta gratuita",
    "Browse Jobs": "Explorar vagas",
    "About": "Sobre",
    "Contact": "Contato",
    "Dashboard": "Painel",
    "My Jobs": "Minhas vagas",
    "My Applications": "Minhas candidaturas",
    "Contact Us": "Fale conosco",
    "WhatsApp": "WhatsApp",
    "Login": "Entrar",
    "Register": "Cadastrar",
    "Profile": "Perfil",
    "Logout": "Sair",
    "Language": "Idioma"
,
    "About PlaceMeNet": "Sobre a PlaceMeNet",
    "Our Story": "Nossa história",
    "Connecting brilliant talent with ambitious employers across Europe.": "Conectamos talentos brilhantes a empregadores ambiciosos em toda a Europa.",
    "PlaceMeNet was founded with a simple promise: simplify recruitment for fast-growing teams and remove the friction job seekers face when chasing their next career milestone. From curated roles to real-time coaching, we fuse technology with a human touch to build careers that matter.": "A PlaceMeNet nasceu com uma promessa simples: simplificar recrutamento para equipes em rápido crescimento e tirar a fricção que candidatos enfrentam ao buscar o próximo passo. De vagas selecionadas a orientação em tempo real, unimos tecnologia e toque humano para construir carreiras que importam.",
    "Chat on WhatsApp": "Conversar no WhatsApp",
    "Working Hours": "Horário de atendimento",
    "Stay Safe from Job Scams": "Fique seguro contra golpes de emprego",
    "PlacemeNet is committed to worker protection. Follow these rules and share them with your friends and family applying overseas.": "A PlacemeNet é comprometida com a proteção dos trabalhadores. Siga estas regras e compartilhe com amigos e família que se candidatam para o exterior.",
    "PlacemeNet is 100% free": "A PlacemeNet é 100% gratuita",
    "We never charge registration fees, sell visas, or take worker commission. Anyone asking for money in our name is a scam.": "Nunca cobramos inscrição, vendemos vistos ou tomamos comissão do trabalhador. Quem pedir dinheiro em nosso nome é golpe.",
    "Never pay for a job": "Nunca pague por um emprego",
    "Do not send money via cash, bank, Easypaisa, JazzCash, WhatsApp, or crypto. Genuine employers handle costs legally.": "Não envie dinheiro em espécie, banco, Easypaisa, JazzCash, WhatsApp ou cripto. Empregadores legítimos cobrem custos legalmente.",
    "Verify the employer": "Verifique o empregador",
    "Collect a written offer, company license, visa document, and detailed contract before you travel. Contact us if anything looks suspicious.": "Obtenha oferta escrita, licença da empresa, documento de visto e contrato detalhado antes de viajar. Fale conosco se algo parecer suspeito.",
    "Official communication only": "Apenas comunicação oficial",
    "PlacemeNet does not operate via TikTok, Telegram, or random WhatsApp agents. Trust only @placemenet.net emails or the website chat.": "A PlacemeNet não opera via TikTok, Telegram ou agentes aleatórios no WhatsApp. Confie apenas em emails @placemenet.net ou no chat do site.",
    "Feel unsafe? Email :support or :legal. We block offenders and report them to authorities.": "Se sentir inseguro, escreva para :support ou :legal. Bloqueamos infratores e os reportamos às autoridades.",
    "Worker Dashboard Highlights": "Destaques do painel do candidato",
    "Apply for overseas jobs and track every application.": "Candidate-se a vagas no exterior e acompanhe cada aplicação.",
    "Complete your profile with experience, skills, passport, and preferred countries.": "Complete seu perfil com experiência, habilidades, passaporte e países preferidos.",
    "Receive interview calls, employer messages, and safety alerts reminding you PlacemeNet is always free.": "Receba ligações de entrevista, mensagens de empregadores e alertas de segurança lembrando que a PlacemeNet é sempre gratuita.",
    "Manage account settings—update phone/email or delete your account anytime.": "Gerencie a conta: atualize telefone/email ou exclua a conta a qualquer momento.",
    "Employer Dashboard Promise": "Promessa do painel do empregador",
    "Post jobs for free in Greece or Albania and get unlimited applications.": "Publique vagas grátis na Grécia ou Albânia e receba candidaturas ilimitadas.",
    "Review skills, shortlist candidates, and message workers directly.": "Revise habilidades, faça shortlist e envie mensagens diretas.",
    "Keep hiring transparent—no fake jobs, no illegal recruitment fees, and full compliance with labor laws.": "Mantenha a contratação transparente: nada de vagas falsas, taxas ilegais ou descumprimento das leis trabalhistas.",
    "Violations lead to permanent bans because we protect both workers and reputable employers.": "Violações levam a banimentos permanentes porque protegemos trabalhadores e empregadores sérios.",
    "Contact PlaceMeNet": "Fale com a PlaceMeNet",
    "Get in touch": "Entre em contato",
    "We are here to support your next hire or career move.": "Estamos aqui para apoiar sua próxima contratação ou movimento de carreira.",
    "Reach our talent success team by phone, WhatsApp, or visit one of our offices during opening hours. We’ll route your message to the right specialist right away.": "Fale com nossa equipe de sucesso de talentos por telefone, WhatsApp ou visite um de nossos escritórios no horário de atendimento. Encaminharemos sua mensagem para o especialista certo imediatamente.",
    "Email Us": "Envie um e-mail",
    "WhatsApp: :number": "WhatsApp: :number",
    "Head Office": "Sede",
    "Open in Google Maps": "Abrir no Google Maps"
}
