{
    "Welcome to PlaceMeNet - Find Your Dream Job": "Mireseerdhët në PlaceMeNet - Gjeni punën tuaj të ëndrrave",
    "Find Your": "Gjeni",
    "Dream Job": "punën e ëndrrave",
    "Today": "sot",
    "Connect with thousands of top employers and discover": "Lidhu me mijëra punëdhënës të njohur dhe zbulo",
    "opportunities": "mundësi",
    "Your next career move starts here": "Hapi juaj i radhës në karrierë fillon këtu",
    "Job title, keywords, or company": "Titulli i punës, fjalë kyçe ose kompani",
    "City, state, or remote": "Qytet, shtet ose në distancë",
    "Search Jobs": "Kërko punë",
    "Popular:": "Popullore:",
    "Software Engineer": "Inxhinier softueri",
    "Marketing": "Marketing",
    "Remote Jobs": "Punë në distancë",
    "Data Analyst": "Analist të dhënash",
    "Job Seeker Login": "Hyrje për kandidatët",
    "Employer Login": "Hyrje për punëdhënësit",
    "Register Now": "Regjistrohu tani",
    "Upload Resume": "Ngarko CV",
    "Active Jobs": "Punë aktive",
    "Companies": "Kompani",
    "Job Seekers": "Kandidatët",
    "Success Rate": "Shkalla e suksesit",
    "Browse Jobs by Category": "Shfleto punët sipas kategorisë",
    "Explore opportunities across various industries": "Eksploro mundësi në industri të ndryshme",
    "jobs": "punë",
    "No categories available": "Nuk ka kategori të disponueshme",
    "View All Categories": "Shiko të gjitha kategoritë",
    "Featured Jobs": "Punë të përzgjedhura",
    "Hand-picked opportunities from top companies": "Mundësi të zgjedhura nga kompani kryesore",
    "Featured": "E veçuar",
    "Competitive": "Konkurruese",
    "Apply Now": "Apliko tani",
    "No featured jobs available": "Nuk ka punë të veçuara",
    "Browse All Jobs": "Shfleto të gjitha punët",
    "How It Works": "Si funksionon",
    "Your journey to the perfect job in three simple steps": "Udhetimi juaj drejt punës së duhur në tre hapa të thjeshtë",
    "Create Your Profile": "Krijo profilin tënd",
    "Sign up and build your professional profile with skills and experience": "Regjistrohu dhe ndërto profilin profesional me aftësi dhe përvojë",
    "Search & Apply": "Kërko dhe apliko",
    "Browse thousands of jobs and apply with one click": "Shfleto mijëra punë dhe apliko me një klikim",
    "Get Hired": "Punësohu",
    "Connect with employers and land your dream job": "Lidhu me punëdhënës dhe merr punën e ëndrrave",
    "Ready to Start Your Career Journey?": "Gati të nisni rrugëtimin tuaj në karrierë?",
    "Join thousands of job seekers who found their dream jobs": "Bashkohu me mijëra kandidatë që gjetën punën e ëndrrave",
    "Create Free Account": "Krijo llogari falas",
    "Browse Jobs": "Shfleto punë",
    "About": "Rreth nesh",
    "Contact": "Kontakt",
    "Dashboard": "Paneli",
    "My Jobs": "Punët e mia",
    "My Applications": "Aplikimet e mia",
    "Contact Us": "Na kontaktoni",
    "WhatsApp": "WhatsApp",
    "Login": "Hyr",
    "Register": "Regjistrohu",
    "Profile": "Profili",
    "Logout": "Dil",
    "Language": "Gjuha"
,
    "About PlaceMeNet": "Rreth PlaceMeNet",
    "Our Story": "Historia jonë",
    "Connecting brilliant talent with ambitious employers across Europe.": "Lidhim talente të shkëlqyera me punëdhënës ambiciozë në gjithë Evropën.",
    "PlaceMeNet was founded with a simple promise: simplify recruitment for fast-growing teams and remove the friction job seekers face when chasing their next career milestone. From curated roles to real-time coaching, we fuse technology with a human touch to build careers that matter.": "PlaceMeNet u themelua me një premtim të thjeshtë: të thjeshtojë rekrutimin për ekipe që rriten shpejt dhe të heqë pengesat që hasin kandidatët drejt hapit të radhës. Nga rolet e përzgjedhura te mentorimi në kohë reale, bashkojmë teknologjinë me prekjen njerëzore për të ndërtuar karriera që vlejnë.",
    "Chat on WhatsApp": "Bisedo në WhatsApp",
    "Working Hours": "Orari i punës",
    "Stay Safe from Job Scams": "Qëndro i sigurt nga mashtrimet e punës",
    "PlacemeNet is committed to worker protection. Follow these rules and share them with your friends and family applying overseas.": "PlacemeNet është e përkushtuar për mbrojtjen e punëtorëve. Ndiq këto rregulla dhe nda t’i me miq e familje që aplikojnë jashtë vendit.",
    "PlacemeNet is 100% free": "PlacemeNet është 100% falas",
    "We never charge registration fees, sell visas, or take worker commission. Anyone asking for money in our name is a scam.": "Nuk ngarkojmë tarifa regjistrimi, nuk shesim viza dhe nuk marrim komision nga punëtorët. Kushdo që kërkon para në emrin tonë është mashtrim.",
    "Never pay for a job": "Mos paguani kurrë për një punë",
    "Do not send money via cash, bank, Easypaisa, JazzCash, WhatsApp, or crypto. Genuine employers handle costs legally.": "Mos dërgo para me cash, bankë, Easypaisa, JazzCash, WhatsApp ose kripto. Punëdhënësit seriozë i mbulojnë kostot ligjërisht.",
    "Verify the employer": "Verifiko punëdhënësin",
    "Collect a written offer, company license, visa document, and detailed contract before you travel. Contact us if anything looks suspicious.": "Merr ofertë me shkrim, licencë kompanie, dokument vize dhe kontratë të detajuar para udhëtimit. Na kontakto nëse diçka duket e dyshimtë.",
    "Official communication only": "Vetëm komunikim zyrtar",
    "PlacemeNet does not operate via TikTok, Telegram, or random WhatsApp agents. Trust only @placemenet.net emails or the website chat.": "PlacemeNet nuk operon përmes TikTok, Telegram ose agjentëve të rastësishëm në WhatsApp. Beso vetëm email-et @placemenet.net ose chat-in e faqes.",
    "Feel unsafe? Email :support or :legal. We block offenders and report them to authorities.": "Ndihemi i pasigurt? Shkruaj në :support ose :legal. Ne bllokojmë shkelësit dhe i raportojmë autoriteteve.",
    "Worker Dashboard Highlights": "Pikat kryesore të panelit të kandidatëve",
    "Apply for overseas jobs and track every application.": "Apliko për punë jashtë vendit dhe ndiq çdo aplikim.",
    "Complete your profile with experience, skills, passport, and preferred countries.": "Plotëso profilin me përvojë, aftësi, pasaportë dhe vende të preferuara.",
    "Receive interview calls, employer messages, and safety alerts reminding you PlacemeNet is always free.": "Merr telefonata intervistash, mesazhe punëdhënësish dhe paralajmërime sigurie që kujtojnë se PlacemeNet është gjithmonë falas.",
    "Manage account settings—update phone/email or delete your account anytime.": "Menaxho rregullimet e llogarisë—përditëso telefonin/email ose fshij llogarinë kur të duash.",
    "Employer Dashboard Promise": "Premtimi i panelit të punëdhënësit",
    "Post jobs for free in Greece or Albania and get unlimited applications.": "Posto punë falas në Greqi ose Shqipëri dhe merr aplikime të pakufizuara.",
    "Review skills, shortlist candidates, and message workers directly.": "Rishiko aftësitë, përzgjidh kandidatët dhe dërgo mesazhe direkt.",
    "Keep hiring transparent—no fake jobs, no illegal recruitment fees, and full compliance with labor laws.": "Mbaj rekrutimin transparent—pa vende pune të rreme, pa tarifa të paligjshme dhe me respektim të plotë të ligjeve të punës.",
    "Violations lead to permanent bans because we protect both workers and reputable employers.": "Shkeljet sjellin bllokime të përhershme sepse mbrojmë punëtorët dhe punëdhënësit seriozë.",
    "Contact PlaceMeNet": "Kontakto PlaceMeNet",
    "Get in touch": "Lidhu me ne",
    "We are here to support your next hire or career move.": "Ne jemi këtu për të mbështetur punësimin ose lëvizjen tënde në karrierë.",
    "Reach our talent success team by phone, WhatsApp, or visit one of our offices during opening hours. We’ll route your message to the right specialist right away.": "Kontakto ekipin tonë të suksesit të talenteve me telefon, WhatsApp ose vizito një nga zyrat tona gjatë orarit. Do ta dërgojmë menjëherë mesazhin tek specialisti i duhur.",
    "Email Us": "Na dërgo email",
    "WhatsApp: :number": "WhatsApp: :number",
    "Head Office": "Zyra qendrore",
    "Open in Google Maps": "Hap në Google Maps"
}
