app/Http/Controllers/Employer/DashboardController.php

select count(*) as aggregate from `job_applications` where `job_id` in (1) and `status` = 'pending' and `job_applications`.`deleted_at` is null
select * from `job_applications` where `job_id` in (1) and `job_applications`.`deleted_at` is null order by `created_at` desc limit 5
---
    public function index()
    {
        $user = Auth::user();
        $company = $user->company;

        // Redirect educational institutions to setup page if missing profile
        if ($user->hasRole('educational_institution') && !$company) {
            return redirect()->route('institution.setup');
        }

        $activeJobs = 0;
        $totalApplications = 0;
        $pendingApplications = 0;
        $recentApplications = collect();

        if ($company) {
            $activeJobs = Job::where('company_id', $company->id)
                ->where('status', 'published')
                ->count();

            $jobIds = Job::where('company_id', $company->id)->pluck('id');

            $totalApplications = JobApplication::whereIn('job_id', $jobIds)->count();

            $pendingApplications = JobApplication::whereIn('job_id', $jobIds)
                ->where('status', 'pending')
                ->count();

            $recentApplications = JobApplication::whereIn('job_id', $jobIds)
                ->with(['user', 'job'])
                ->latest()
                ->take(5)
                ->get();