app/Http/Controllers/Employer/JobController.php

    public function index()
    {
        $company = Auth::user()->company;

        if (!$company) {
            return redirect()->route('employer.company.create')
                ->with('warning', 'Please create a company profile first.');
        }

        $jobs = Job::where('company_id', $company->id)
            ->with(['category', 'jobType'])
            ->withCount('applications')
            ->latest()
            ->paginate(10);
---
select * from `companies` where `companies`.`user_id` = 3 and `companies`.`user_id` is not null and `companies`.`deleted_at` is null limit 1
select * from `categories` where `categories`.`id` in (12)
select * from `job_types` where `job_types`.`id` in (3)

    public function create()
    {
        if (!Auth::user()->company) {
            return redirect()->route('employer.company.create')
                ->with('warning', 'Please create a company profile first.');
        }

        // Check if user can post a job
        if (!$this->canPostJob()) {
            return redirect()->route('employer.packages')
                ->with('warning', 'You have reached your job posting limit. Please upgrade to a package to post more jobs.');
        }

        $categories = Category::where('is_active', true)->orderBy('name')->get();
        $jobTypes = JobType::where('is_active', true)->orderBy('name')->get();
        $employmentTypes = EmploymentType::where('is_active', true)->orderBy('name')->get();
        $skills = Skill::where('is_active', true)->orderBy('name')->get();
---
select * from `categories` where `is_active` = 1 order by `name` asc
select * from `job_types` where `is_active` = 1 order by `name` asc
select * from `employment_types` where `is_active` = 1 order by `name` asc
select * from `skills` where `is_active` = 1 order by `name` asc

    public function store(Request $request)
    {
        $company = Auth::user()->company;

        if (!$company) {
            return redirect()->route('employer.company.create')
                ->with('warning', 'Please create a company profile first.');
---
select * from `companies` where `companies`.`user_id` = 3 and `companies`.`user_id` is not null and `companies`.`deleted_at` is null limit 1


            // Attach skills
            if (!empty($validated['skills'])) {
                $job->skills()->attach($validated['skills']);
---
insert into `job_skills` (`created_at`, `job_id`, `skill_id`, `updated_at`) values ('2025-12-06 16:50:17', 1, '22', '2025-12-06 16:50:17'), ('2025-12-06 16:50:17', 1, '1', '2025-12-06 16:50:17')

    public function show(Job $job)
    {
        $this->authorizeJob($job);
        $job->load(['company', 'category', 'jobType', 'skills', 'questions']);
---
select * from `categories` where `categories`.`id` in (12)
select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `job_types` where `job_types`.`id` in (3)
select `skills`.*, `job_skills`.`job_id` as `pivot_job_id`, `job_skills`.`skill_id` as `pivot_skill_id`, `job_skills`.`is_required` as `pivot_is_required`, `job_skills`.`created_at` as `pivot_created_at`, `job_skills`.`updated_at` as `pivot_updated_at` from `skills` inner join `job_skills` on `skills`.`id` = `job_skills`.`skill_id` where `job_skills`.`job_id` in (1)