app/Http/Controllers/JobController.php


        $jobs = $query->paginate(20)->withQueryString();

        return view('jobs.index', [
            'jobs' => $jobs,
            'categories' => Category::active()->withCount('jobs')->ordered()->get(),
            'jobTypes' => JobType::active()->get(),
            'employmentTypes' => EmploymentType::active()->get(),
        ]);
---
select * from `categories` where `categories`.`id` in (12)
select * from `employment_types` where `employment_types`.`id` in (2)
select * from `job_types` where `job_types`.`id` in (3)

    public function show(Job $job)
    {
        if ($job->status !== 'published') {
            abort(404);
        }

        $job->increment('views_count');
        $job->load(['company', 'category', 'skills', 'questions', 'jobType', 'employmentType']);
---
select * from `categories` where `categories`.`id` in (12)
select * from `companies` where `companies`.`id` in (1) and `companies`.`deleted_at` is null
select * from `employment_types` where `employment_types`.`id` in (2)
select * from `job_types` where `job_types`.`id` in (3)