app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories = Category::with('parent')
            ->withCount('jobs')
            ->ordered()
            ->paginate(20);
---
select count(*) as aggregate from `categories`