app/Http/Controllers/Admin/UserController.php

select * from `users` where `is_active` = 1 order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `users` where `is_active` = 1
---
    public function index(Request $request)
    {
        $query = User::query();

        // Filter by search
        if ($request->filled('search')) {
            $search = $request->search;
            $query->where(function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%");
            });
        }

        // Filter by user type
        if ($request->filled('type') && $request->type !== 'all') {
            $query->where('user_type', $request->type);
        }

        // Filter by status
        if ($request->filled('status')) {
            $query->where('is_active', $request->status === 'active');
        }

        $users = $query
            ->with(['subscriptions.package'])
            ->latest()
            ->paginate(15)
            ->withQueryString();